Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetMapOfAllSizesForStraights
Get a set of FabricationPartSizeMapSet of all straight sizes for all services.
Returns:
Returns the map of sizes for straights or an empty map if there are none.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetMapOfSizesForStraights(System.Collections.Generic.ISet{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Set the mapping for sizes of fabrication part straights to change the sizes to.
fabricationPartSizeMaps:
The map containing the original straights size to the mapped sizes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetInLinePartTypes
Get a set of element identifiers of fabrication part types for in-line parts.
Returns:
Returns the set of element identifiers for in-line parts or an empty set if there are none.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetMapOfInLinePartTypes(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Set the mapping of fabrication part types for in-line parts for the service and group to change to.
fabricationPartTypes:
The map containing the original fabrication part type to the fabrication part type to change to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetGroupId(System.Int32)
Set the fabrication group identifier to change the elements to.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetServiceId(System.Int32)
Set the fabrication service identifier to change the elements to.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetSelection(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set the element selection to change the service or size for.
selection:
The set of element identifiers of fabrication parts to change the service or size for.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetElementsThatFailed
Gets the set of fabrication parts that had failures due to either there was no corresponding part in the service, the size was out of range, or a connection could not be made.
Remarks:
This set of element identifiers is only available after the ChangeService or ChangeSize method has been invoked, and returns FabricationNetworkChangeServiceResult::Enum::PartialFailure.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged
Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range.
Remarks:
This set of element identifiers is only available after the ChangeService or ChangeSize method has been invoked, and returns FabricationNetworkChangeServiceResult::Enum::PartialFailure.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ApplyChange
Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.GetElementsThatHadFailures to get a set of fabrication part element identifiers that had failures.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ChangeSize(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Collections.Generic.ISet{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Changes the size of the selection of fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.GetElementsThatHadFailures to get a set of fabrication part element identifiers that had failures.
selection:
The set of element identifiers of fabrication parts to change the size for.
fabricationPartSizeMaps:
The map containing the original sizes for the straights to the new sizes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
-or-
The fabrication size map is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.ChangeService(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32,System.Int32)
Changes the service of the selection of fabrication parts.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.GetElementsThatHadFailures to get a set of fabrication part element identifiers that had failures.
selection:
The set of element identifiers of fabrication parts to change the service for.
serviceId:
The identifier of the fabrication service.
groupId:
The identifier of the fabrication group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The selection contains invalid elements to change.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No fabrication configuration is loaded.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.#ctor(Autodesk.Revit.DB.Document)
Creates a new instance of the FabricationNetworkChangeService class.
document:
A document in which to change the service or size of the selected fabrication parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService
This class represents the fabrication part change service and change size tools.
Remarks:
After a new instance of the class is created, call the ChangeService method to change the service of the
fabrication parts or call the ChangeSize method to change the size of the fabrication parts. There is another
workflow allowing for more control, call SetSelection to set the selection of fabrication parts to change. To change
the service, call SetServiceId and SetGroupId to set the service identifier and group identifier. Changing
the service there is an optional methods GetInLinePartTypes and SetMapOfSizesForStraights that can be called
to replace in-line valves and dampers to the corresponding parts for the new service. The size can also be changed by calling
GetMapOfAllSizesForStraights that will return a FabricationPartSizeMapSet containing a map of sizes for all straights
found in the selection of fabrication parts. The FabricationPartSizeMapSet can then be modified to set the mapped values for
the new size for the fabrication part straights and then call SetMapOfSizesForStraights set the new sizes that are to
be applied. Finally call ApplyChange to apply the previously set parameters to the selection of fabrication parts.
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.GetElementsThatHadFailures to get a set of fabrication part element identifiers that had failures.
Since:
2018.2